SNMP IMPLEMENT
Router(config)#Snmp-server co
Router(config)#Snmp-server community r
Router(config)#Snmp-server community ro
%SNMP-5-WARMSTART: SNMP agent on host Router is undergoing a warm start
Router(config)# snmp-server community wr
Router(config)# snmp-server community write rw

SYSLOG AND NETFLOW
Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address  
Router(config-if)#ip address 10.0.0.1 255.0.0.0
Router(config-if)#ip address 10.0.0.1 255.0.0.0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 30.0.0.1 255.0.0.0
Router(config-if)#ip address 30.0.0.1 255.0.0.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#service timestamps log datetime msec
Router(config)#logging host 10.0.0.2
Router(config)#int g0/0.2
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router rip
Router(config-router)#
*Mar 01, 00:08:07.088: SYS-5-CONFIG_I: Configured from console by consolenetwork 10.0.0.0
Router(config-router)#network 30.0.0.0

Router(config-router)#exit
Router(config)#interface g0/0.1
Router(config-subif)#no shut
Router(config-subif)#end
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface GigabitEthernet0/0

Router(config)#int g0/0
Router(config-if)#ip flow ingress 
Router(config-if)#ip flow egress 
Router(config-if)#ip flow-export destination 10.0.0.2 99
Router(config)#ip flow-export source g0/0
Router#show ip cache flow 
